app/controllers/event_venues_controller.rb

INSERT INTO "event_venues" ("name", "address", "capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ernesto"], ["address", "Parque Ohiggins"], ["capacity", 1300], ["created_at", "2019-04-10 15:31:50.628209"], ["updated_at", "2019-04-10 15:31:50.628209"]]
---
  def create
    @event_venue = EventVenue.new(event_venue_params)
    if @event_venue.save

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "event_venues" WHERE "event_venues"."id" = ?  [["id", 1]]
---
  def destroy
    @event_venue = EventVenue.find(params[:id])
    @event_venue.destroy

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def update
    @event_venue = EventVenue.find(params[:id])