app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-04-10 22:53:03.326786"], ["updated_at", "2019-04-10 22:53:03.326786"]]
---
  def create
    @user = User.new(params[user_params])
    if @user.save